Revit 2027 API
Document.LoadFamily(String) Method
Loads an entire family and all its types/symbols into the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool LoadFamily(
	string filename
)
Public Function LoadFamily (
	filename As String
) As Boolean
public:
bool LoadFamily(
	String^ filename
)
member LoadFamily :
        filename : string -> bool
Parameters
filename String
The fully qualified filename of the Family file, usually ending in .rfa.
Return Value
Boolean
True if the entire family was loaded successfully into the project, otherwise False.
Exceptions
Exception | Condition
ArgumentException |  Thrown when filename is null or empty.
Remarks
Loading an entire family may take a considerable amount of time and memory. It is recommended that you use one of the LoadFamilySymbol() methods and only load those symbols that you need.
See Also
Reference
Document Class
LoadFamily Overload
Autodesk.Revit.DB Namespace